<script setup lang='ts'>
import Footer from '@/components/Footer.vue'

</script>

<template>
    <div>
        <router-link :to="{name: 'home'}" class="fixed btn btn-sm no-underline text-xl text-white">На головну</router-link>
        <h1>PW Ukraine - Користувацька угода</h1>
        <h2>1. Загальні положення</h2>
        <ol>
            <li>Адміністрація залишає за собою право вносити будь-які зміни та оновлення на сервері без попереднього
                повідомлення гравців.</li>
            <li>Адміністрація має право в будь-який момент, без пояснення причин, припинити надання доступу до сервера
                конкретному користувачу або підмережі в цілому.</li>
            <li>Адміністрація залишає за собою право втручатися в хід ігрових та форумних подій на власний розсуд.</li>
            <li>Адміністрація не несе відповідальності за втрату ігрового майна і т.п. внаслідок незнання правил гри та
                правил безпеки користування ігровим сервісом.</li>
            <li>Реєструючи обліковий запис, ви автоматично погоджуєтесь з цими правилами та зобов'язуєтесь їх
                дотримуватися.</li>
            <li>Незнання правил не звільняє від відповідальності за їх порушення, гравець зобов'язаний самостійно
                відслідковувати зміни в цьому угоді.</li>
            <li>Це неофіційна версія гри, яка не претендує на оригінал.</li>
            <li>Адміністрація гри не приймає активної участі в ігровому процесі. Зв'язок з гравцями відбувається через
                технічну підтримку та спеціальні розділи на форумі.</li>
            <li>Не підтримуємо мовну війну. Гра українською, але спілкуватися можна будь-якою мовою.</li>
            <li>За підтримку агресії проти України та її народу, зокрема пропаганду РФ, гравець буде заблокований.</li>
        </ol>

        <h2>2. Ігровий процес</h2>
        <ol>
            <li>Заборонено використання програмного забезпечення (або поширення інформації про нього), яке впливає
                будь-яким чином на роботу сервера або ігровий процес.</li>
            <li>Заборонено використання багів гри або серверного ПЗ.</li>
            <li>Гравець зобов'язаний негайно повідомити Адміністрацію про виявлений баг, помилку, недолік гри або
                серверного ПЗ, а також про порушника, який використовує такі помилки. Приховування цієї інформації
                розцінюється як співучасть.</li>
            <li>Заборонено використання та приховування ігрових цінностей та грошей (юаней
                і золота), прямо або опосередковано отриманих в результаті використання стороннього програмного
                забезпечення. У разі виникнення такої ситуації гравець зобов'язаний негайно повідомити про порушення
                Адміністрації.</li>
            <li>Заборонено використання в загальних каналах і сервісах спілкування в грі та на форумі ненормативної
                лексики, образ, погроз насильства або фізичної розправи, образ близьких людей або провокацій на такі
                образи, реклами наркотиків, порнографічних матеріалів, пропаганди нетерпимості до расової, національної,
                релігійної, культурної, ідеологічної, статевої, мовної або політичної приналежності, а також заохочення
                подібних дій і висловлювань, скоєних іншими гравцями.</li>
            <li>Заборонено використання будь-яких нецензурних, образливих слів та символів в будь-якому вигляді в
                найменуваннях або описах персонажів, гільдій та інших ігрових об'єктів.</li>
            <li>Заборонено флуд (багаторазово повторювані або безглузді повідомлення) в ігровому чаті (загальному,
                торговому, клановому, світовому або приватному).</li>
            <li>Заборонено в грі та на форумі створення імен персонажів, назв предметів, внутрішньоігрових об'єктів, що
                містять нецензурну лексику, що ображають інших гравців. Адміністрація залишає за собою право давати
                власну остаточну лінгвістичну оцінку відповідності будь-яких фраз і слів за пунктами 2.4 - 2.6, і оцінку
                тяжкості порушення за пунктом 2.7.</li>
            <li>Заборонено в грі та на форумі створення імен персонажів, назв предметів, внутрішньоігрових об'єктів,
                спільнот і організацій гравців та будь-яких інших знаків відмінності, що вказують на приналежність до
                Адміністрації.</li>
            <li>Заборонено в будь-якій формі рекламувати і поширювати інформацію про сторонні інтернет-ресурси.</li>
            <li>Заборонено злом, шахрайство, несанкціонований доступ до чужого ігрового облікового запису. Намірено
                вводити в оману інших гравців з метою отримання доступу до їхніх облікових записів.</li>
            <li>Торгівля ігровими цінностями здійснюється безпосередньо самими гравцями, і будь-які помилки, допущені
                учасниками торговельних відносин, залишаються на їхній совісті.</li>
            <li>Торгівля ігровими персонажами та обліковими записами заборонена. Торгівля ігровими цінностями за
                неігрові грошові одиниці заборонена. Передача ігрових облікових записів заборонена. У разі виявлення
                факту купівлі/продажу/обміну/передачі, ігровий обліковий запис порушника буде заблоковано.</li>
            <li>Заборонено навмисне вчинення будь-яких дій, що ускладнюють або роблять неможливим доступ до гри іншим
                користувачам, створення в грі навмисних перешкод для інших користувачів, не передбачених існуючим
                ігровим процесом (вбивство гравців (ПК - Player Killing) на сервері є ігровим моментом і не карається,
                крім випадків, передбачених цим пунктом).</li>
        </ol>
        <h2>3. Гільдії</h2>
        <ol>
            <li>Гравці мають право створювати, видаляти, керувати гільдіями необмежено на власний розсуд.</li>
            <li>Заборонено використовувати двозначні, образливі, провокуючі назви та аватари у символіці та назвах
                гільдій.</li>
            <li>Заборонено використовувати назви та аватари, що вказують на приналежність до Адміністрації, у символіці
                та назвах гільдій.</li>
        </ol>

        <h2>4. Взаємодія з адміністрацією</h2>
        <ol>
            <li>Заборонено звертатися до Адміністрації або GM сервера без крайньої необхідності. Будь-яке звернення до
                Адміністрації повинно містити чітке викладення проблеми гравця. Перед зверненням перевірте, чи не було
                ваше питання вже підняте на форумі гри.</li>
            <li>Заборонено неуважливе ставлення, наклеп, погрози, шантаж і обман на адресу Адміністрації, обговорення
                дій та роботи Адміністрації сервера, як на форумі, так і в грі.</li>
            <li>Заборонено сперечатися з Представниками проекту та оскаржувати їх дії.</li>
            <li>Заборонено докучати Адміністрації питаннями, не пов'язаними з ігровим процесом.</li>
            <li>Заборонена публікація та розголошення переписки (або її змісту) з Адміністрацією або GM без попереднього
                погодження.</li>
            <li>У разі незгоди з діями GM, гравець може написати скаргу в службу підтримки. Скарга повинна бути
                викладена аргументовано, без емоцій та порушень інших пунктів правил, а також повинна бути підтверджена
                скріншотом або відеофайлом.</li>
        </ol>

        <p>З системою покарань і штрафів можна ознайомитися в цій темі. Якщо ви хочете грати в повну версію гри, вам
            потрібно перейти на офіційний сервер <a href="https://www.playpwi.com/en/">https://www.playpwi.com/en/</a>.
            Наш сервер є демонстраційним і використовує неоновлену версію гри. Підключаючись до сервера, переглядаючи
            сайт та використовуючи його, ви залишаєтеся гостем цього ресурсу, маєте право перебувати на ресурсі та
            користуватися ним, підключатися до сервера та знаходитися на ньому доти, доки не порушите будь-яку з умов
            або правил, описаних вище. Адміністрація залишає за собою право вносити зміни до зводу правил без пояснення
            причин і цілей цих змін.</p>
    </div>
    <Footer />
</template>
<style scoped lang='scss'>
h1,
h2 {
    margin: 0 0 10px 0;
    text-align: center;
    margin-top: 40px;
}
a {
    text-decoration: none;
    color: rgb(85, 85, 234);
}

a:hover {
    text-decoration: underline;
}

div {
    padding: 20px 50px 50px 50px;
    background: linear-gradient(180deg, #16171b 20%, rgb(39, 50, 68) 100%);
    color: #fff;
}

ol {
    margin-left: 20px;
    margin-top: 20px;
}

li {
    margin-bottom: 10px;
}
</style>