<script setup lang="ts">
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";
</script>

<template>
  <Header />
  <div class="terms-page">
    <div class="terms-page__img">
      <img src="@/assets/images/terms-main-img.jpg" class="terms-page__img-img" alt="terms page bg">
      <div class="terms-page__logo-container">
        <video class="terms-page__logo-video" autoplay muted loop playsinline>
          <source src="@/assets/video/Fireball.webm" type="video/webm">
        </video>
        <img class="terms-page__logo" src="@/assets/images/hero-logo.png" alt="terms page logo">
      </div>
      <img src="@/assets/images/CTA-mask.png" class="terms-page__mask-bottom" alt="terms page mask bottom">
    </div>
    <div class="terms-page__inner">
    <h1 class="terms-page__title">Користувацька  <br> Угода Valor</h1>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
    <h3 class="terms-page__intro-text">
      Підключаючись до сервера, переглядаючи сайт та використовуючи його, ви
      залишаєтеся гостем цього ресурсу, маєте право перебувати на ресурсі та
      користуватися ним, підключатися до сервера та знаходитися на ньому доти,
      доки не порушите будь-яку з умов або правил, описаних нижче.
    </h3>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
    <h2 class="terms-page__section-title">1. Загальні положення</h2>
    <ol class="terms-page__list">
      <li>
        Адміністрація залишає за собою право вносити будь-які зміни та оновлення
        на сервері без попереднього повідомлення гравців.
      </li>
      <li>
        Адміністрація має право в будь-який момент, без пояснення причин,
        припинити надання доступу до сервера конкретному користувачу або
        підмережі в цілому.
      </li>
      <li>
        Адміністрація не втручається в хід ігрових та форумних подій, доки не
        були порушені правила користувацької угоди.
      </li>
      <li>
        Адміністрація не несе відповідальності за втрату ігрового майна і т.п.
        внаслідок незнання правил гри та правил безпеки користування ігровим
        сервісом.
      </li>
      <li>
        Реєструючи обліковий запис, ви автоматично погоджуєтесь з цими правилами
        та зобов'язуєтесь їх дотримуватися.
      </li>
      <li>
        Незнання правил не звільняє від відповідальності за їх порушення,
        гравець зобов'язаний самостійно відслідковувати зміни в цій угоді.
      </li>
      <li>
        Адміністрація гри не приймає активної участі в ігровому процесі. Зв'язок
        з гравцями відбувається через технічну підтримку та спеціальні розділи
        на форумі.
      </li>
      <li>
        За підтримку агресії проти України та її народу, зокрема пропаганду РФ, гравець буде заблокований.
      </li>
      <li>
        За використання мови агресора у загальних каналах спілкування — попередження, після ігнорування якого бан.
      </li>
    </ol>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">

    <h2 class="terms-page__section-title">2. Ігровий процес</h2>
    <ol class="terms-page__list">
      <li>
        Заборонено використання програмного забезпечення (або поширення
        інформації про нього), яке впливає будь-яким чином на роботу сервера або
        ігровий процес.
        <p class="mt-3">⚠️ Покарання застосовується до всіх персонажів на всіх акаунтах, що належать гравцю, незалежно від того, на якому саме персонажі було зафіксовано порушення.</p>
        <br><p><b>За використання ботів для автоматизації ігрових дій:</b></p>
        <ul>
          <li>1 порушення — блокування всіх акаунтів гравця на 1 годину</li>
          <li>2 порушення — блокування всіх акаунтів гравця на 12 годин</li>
          <li>3 порушення — блокування всіх акаунтів гравця на 24 години</li>
          <li>4 і більше порушень — перманентне блокування всіх акаунтів гравця</li>
        </ul>
      </li>
      <li>Заборонено використання багів гри або серверного ПЗ.</li>
      <li>
        Гравець зобов'язаний негайно повідомити Адміністрацію про виявлений баг,
        помилку, недолік гри або серверного ПЗ, а також про порушника, який
        використовує такі помилки. Приховування цієї інформації розцінюється як
        співучасть.
      </li>
      <li>Заборонено будь-яким чином змінювати, видаляти, підміняти або додавати файли ігрового клієнта, у тому числі його ресурси, скрипти та інші компоненти, з метою отримання переваги в ігровому процесі або обходу його обмежень.</li>
      <li>
        Заборонено використання та приховування ігрових цінностей та грошей
        (юаней і золота), прямо або опосередковано отриманих в результаті
        використання стороннього програмного забезпечення. У разі виникнення
        такої ситуації гравець зобов'язаний негайно повідомити про порушення
        Адміністрації.
      </li>
      <li>
  Заборонено використання у загальних каналах і сервісах спілкування в грі та на форумі:
  <ul class="mt-1 pl-5">
    <li>ненормативної лексики, образ, погроз насильства або фізичної розправи;</li>
    <li>образ близьких людей чи провокацій на подібні образи;</li>
    <li>
      будь-яких проявів булінгу, цькування, переслідування чи переходу на особистості, 
      включно із завуальованими формами (натяки, сарказм, образливі прізвиська тощо);
    </li>
    <li>
      реклами наркотиків, порнографічних матеріалів, пропаганди нетерпимості до расової, 
      національної, релігійної, культурної, ідеологічної, статевої, мовної або політичної приналежності, 
      а також заохочення подібних дій і висловлювань.
    </li>
  </ul>
  
  <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
  <p><strong style="color: #cb3d16;">Важливо:</strong> Це правило <em>не стосується ігрових моментів</em>, пов’язаних із змагальністю чи діями персонажів у грі, якщо вони не переходять у сферу особистих образ чи цькування.</p>
  <p class="mt-1">За порушення даного правила накладається тимчасове блокування чату (БЧ) з поступовим збільшенням терміну:</p>
  <ol class="terms-page__list">
    <li>1 година</li>
    <li>3 години</li>
    <li>24 години</li>
    <li>3 доби</li>
  </ol>
  <p>У разі систематичних чи особливо грубих порушень — <strong>блокування персонажа</strong>.</p>
  <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
</li>
      <li>
        Заборонено флуд (багаторазово повторювані або безглузді повідомлення) в
        ігровому чаті (загальному, торговому, клановому, світовому або
        приватному).
      </li>
      <li>
        Заборонено створювати імена персонажів, назви предметів, гільдій чи інших внутрішньоігрових об'єктів, що містять нецензурну лексику, натяки на неї, або будь-які інші елементи, які можуть образити, принизити чи спровокувати інших гравців.
      </li>
      <li>
        Заборонено в грі та на форумі створення імен персонажів, назв предметів,
        внутрішньоігрових об'єктів, спільнот і організацій гравців та будь-яких
        інших знаків відмінності, що вказують на приналежність до Адміністрації.
      </li>
      <li>
        Заборонено в будь-якій формі рекламувати і поширювати інформацію про
        сторонні інтернет-ресурси.
      </li>
      <li>
        Заборонено злом, шахрайство, несанкціонований доступ до чужого ігрового
        облікового запису. Вводити в оману інших гравців з метою отримання
        доступу до їхніх облікових записів.
      </li>
      <li>
        Торгівля ігровими цінностями здійснюється безпосередньо самими гравцями,
        і будь-які помилки, допущені учасниками торговельних відносин,
        залишаються на їхній совісті.
      </li>
      <li>
        Заборонено навмисне вчинення будь-яких дій, що ускладнюють або роблять неможливим доступ до гри іншим користувачам, створення в грі навмисних перешкод для інших користувачів, не передбачених існуючим ігровим процесом (вбивство гравців (ПК — Player Killing) на сервері є ігровим моментом і не карається, крім випадків, передбачених цим пунктом).
        <br />
        Також забороняється зловживання ігровими механіками або функціями з метою перешкоджання нормальному ігровому процесу інших користувачів (наприклад: масове надсилання торгових запитів, спрямоване на ускладнення гри іншому користувачу).
      </li>
      <li>
        Заборонено здійснювати будь-які угоди між гравцями поза межами офіційних торгових майданчиків гри (аукціон, крамниці/коти, тощо).
        <br />
        <span class="block mt-2 font-bold">Це включає, але не обмежується:</span>
        <ul class="mt-1 pl-5">
          <li>Передачею предметів, ресурсів або валюти через ручну торгівлю (РТМ)</li>
          <li>Продажем або спробами продажу ігрових цінностей (предметів, валюти, акаунтів тощо) за реальні кошти в обхід офіційних торгових майданчиків гри.</li>
          <li>Пропонуванням або обговоренням подібних угод у будь-яких каналах для спілкування (чат гри, Discord, особисті повідомлення тощо)</li>
        </ul>
        Порушення цього правила може призвести до тимчасового або постійного блокування акаунта.
      </li>
    </ol>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">

    <h2 class="terms-page__section-title">3. Гільдії</h2>
    <ol>
      <li>
        Гравці мають право створювати, видаляти, керувати гільдіями необмежено
        на власний розсуд.
      </li>
      <li>
        Заборонено використовувати двозначні, образливі, провокуючі назви та
        аватари у символіці та назвах гільдій.
      </li>
      <li>
        Заборонено використовувати назви та аватари, що вказують на
        приналежність до Адміністрації, у символіці та назвах гільдій.
      </li>
      <li>
        Заборонено створювати гільдії з назвою, що співпадає або навмисно імітує назву вже існуючої гільдії. Це правило застосовується незалежно від регістру літер, використання символів, пробілів або схожих за написанням символів.
      </li>
    </ol>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">

    <h2 class="terms-page__section-title">4. Взаємодія з адміністрацією</h2>
    <ol>
      <li>
        Заборонено звертатися до Адміністрації або GM сервера без крайньої
        необхідності. Будь-яке звернення до Адміністрації повинно містити чітке
        викладення проблеми гравця. Перед зверненням перевірте, чи не було ваше
        питання вже підняте на форумі гри.
      </li>
      <li>
        Заборонено неуважливе ставлення, наклеп, погрози, шантаж і обман на
        адресу Адміністрації, обговорення дій та роботи Адміністрації сервера,
        як на форумі, так і в грі.
      </li>
      <li>
        Заборонено сперечатися з Представниками проекту та оскаржувати їх дії.
      </li>
      <li>
        Заборонено докучати Адміністрації питаннями, не пов'язаними з ігровим
        процесом.
      </li>
      <li>
        Заборонена публікація та розголошення переписки (або її змісту) з
        Адміністрацією або GM без попереднього погодження.
      </li>
      <li>
        Адміністрація залишає за собою право давати власну остаточну
        лінгвістичну оцінку відповідності будь-яких фраз і слів, а також оцінку
        тяжкості порушення.
      </li>
      <li>
        У разі незгоди з діями GM, гравець може написати скаргу в службу
        підтримки. Скарга повинна бути викладена аргументовано, без емоцій та
        порушень інших пунктів правил, а також повинна бути підтверджена
        скріншотом або відеофайлом.
      </li>
    </ol>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
    <p class="terms-page__footer-text">
      Наш сервер є фанатським, демонстраційним і використовує неоновлену версію
      гри. Якщо ви хочете грати в повну версію гри, вам потрібно перейти на
      офіційний сервер
      <a class="terms-page__footer-text-link" href="https://www.playpwi.com/en/">https://www.playpwi.com/en/</a>.
    </p>
    <img src="@/assets/images/download-divider.svg" class="terms-page__divider w-full" alt="terms page divider">
    </div>
  </div>
  <Footer />
</template>
<style scoped lang="scss">


.terms-page {

  &__inner {
    max-width: 630px;
    margin: 0 auto;
    padding: 0 15px;
    color: #f8f8f8;
    font-family: "Candara", sans-serif;
  }

  &__title {
    font-family: "Vollkorn SC", serif;
    font-size: clamp(32px, 4vw, 52px);
    font-weight: 400;
  }
  &__intro-text {
    font-size: clamp(14px, 2vw, 20px);
    font-weight: 400;
  }

  &__section-title {
    font-family: "Vollkorn SC", serif;
    font-size: clamp(24px, 2vw, 32px);
    font-weight: 400;
    margin-bottom: clamp(20px, 6vw, 50px);
  }

  &__list {
    display: flex;
    flex-direction: column;
    gap: clamp(10px, 2vw, 25px);
    padding-left: 20px;
  }

  &__footer-text {
    font-size: clamp(14px, 2vw, 20px);
    font-weight: 400;
  }

  &__footer-text-link {
    text-decoration: underline;
    text-decoration-skip-ink: none;
    background: linear-gradient(180deg, #f8f8f8 0%, #fadfae 70%, #fbd298 100%);
    background-clip: text;
    -webkit-background-clip: text;
    -webkit-text-fill-color: transparent;
  }

  ol,
  ul {
    display: flex;
    flex-direction: column;
    gap: clamp(10px, 2vw, 25px);
    padding-left: 20px;
    margin: clamp(10px, 6vw, 20px) 0;
  }

  &__divider {
    width: 100%;
    margin-bottom: clamp(20px, 6vw, 50px);
    margin-top: clamp(20px, 6vw, 50px);
    
  }

  &__img {
    position: relative;
    overflow: hidden;
    padding-top: clamp(20px, 6vw, 100px);

    &-img {
      object-fit: cover;
      min-width: 100%;
    }
  }

  &__logo-container {
    position: absolute;
    top: 50%;
    left: 50%;
    transform: translate(-50%, -50%);
    display: inline-block;
    width: clamp(170px, 20vw, 274px);
    isolation: isolate;
    z-index: 4;
  }

  &__logo {
    position: relative;
    width: 100%;
    height: auto;
    z-index: 1;
  }

  &__logo-video {
    position: absolute;
    inset: 0;
    width: 100%;
    height: 100%;
    object-fit: cover;
    z-index: 2;
    pointer-events: none;
    mix-blend-mode: screen;

    /* маска з PNG-лого (має бути з прозорістю) */
    -webkit-mask-image: url('@/assets/images/hero-logo.png');
    mask-image: url('@/assets/images/hero-logo.png');
    -webkit-mask-size: contain;
    mask-size: contain;
    -webkit-mask-repeat: no-repeat;
    mask-repeat: no-repeat;
    -webkit-mask-position: center;
    mask-position: center;

    filter: contrast(1.6) brightness(1.2);
  }

  &__mask-bottom {
    transform: rotate(180deg);
    position: absolute;
    bottom: -1px;
    left: -1px;
    width: 100%;
    height: clamp(50px, 10vw, 197px);
    z-index: 3;
  }
}
</style>
